Can't use Workplane that is not a Level. Set the desired Level as current Workplane.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId WorkplaneShouldBeLevel { get; }
  Visual Basic
Public Shared ReadOnly Property WorkplaneShouldBeLevel As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ WorkplaneShouldBeLevel {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures RoofFailures Class
  Autodesk.Revit.DB Namespace